experiments/results/batches/6505451-two-policy-smoke/raw/adaptive-cold-cache-01-20260829T031245Z/k6.log
time="2026-08-29T03:12:49Z" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"gracefulStop\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/hls.js
        output: json (/results/k6-metrics.jsonl)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 48s max duration (incl. graceful stop):
              * default: Up to 5 looping VUs for 18s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 1/5 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1/5 VUs  01.0s/18.0s

running (02.0s), 1/5 VUs, 0 complete and 0 interrupted iterations
default   [  11% ] 1/5 VUs  02.0s/18.0s

running (03.0s), 2/5 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 2/5 VUs  03.0s/18.0s

running (04.0s), 2/5 VUs, 4 complete and 0 interrupted iterations
default   [  22% ] 2/5 VUs  04.0s/18.0s

running (05.0s), 2/5 VUs, 14 complete and 0 interrupted iterations
default   [  28% ] 2/5 VUs  05.0s/18.0s

running (06.0s), 2/5 VUs, 24 complete and 0 interrupted iterations
default   [  33% ] 2/5 VUs  06.0s/18.0s

running (07.0s), 2/5 VUs, 34 complete and 0 interrupted iterations
default   [  39% ] 2/5 VUs  07.0s/18.0s

running (08.0s), 2/5 VUs, 44 complete and 0 interrupted iterations
default   [  44% ] 2/5 VUs  08.0s/18.0s

running (09.0s), 3/5 VUs, 54 complete and 0 interrupted iterations
default   [  50% ] 3/5 VUs  09.0s/18.0s

running (10.0s), 4/5 VUs, 72 complete and 0 interrupted iterations
default   [  56% ] 4/5 VUs  10.0s/18.0s

running (11.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  61% ] 5/5 VUs  11.0s/18.0s

running (12.0s), 5/5 VUs, 119 complete and 0 interrupted iterations
default   [  67% ] 5/5 VUs  12.0s/18.0s

running (13.0s), 5/5 VUs, 144 complete and 0 interrupted iterations
default   [  72% ] 5/5 VUs  13.0s/18.0s

running (14.0s), 5/5 VUs, 162 complete and 0 interrupted iterations
default   [  78% ] 5/5 VUs  14.0s/18.0s

running (15.0s), 5/5 VUs, 187 complete and 0 interrupted iterations
default   [  83% ] 5/5 VUs  15.0s/18.0s

running (16.0s), 5/5 VUs, 212 complete and 0 interrupted iterations
default   [  89% ] 5/5 VUs  16.0s/18.0s

running (17.0s), 4/5 VUs, 235 complete and 0 interrupted iterations
default   [  94% ] 4/5 VUs  17.0s/18.0s

running (18.0s), 3/5 VUs, 249 complete and 0 interrupted iterations
default   [ 100% ] 3/5 VUs  18.0s/18.0s


  █ THRESHOLDS 

    hls_playlist_failures
    ✓ 'count>=0' count=0

    hls_segment_failures
    ✓ 'count>=0' count=0

    hls_session_failures
    ✓ 'rate>=0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 756     41.678228/s
    checks_succeeded...: 100.00% 756 out of 756
    checks_failed......: 0.00%   0 out of 756

    ✓ master playlist is 200
    ✓ media playlist is 200
    ✓ segment is 200

    CUSTOM
    hls_playlist_failures..........: 0      0/s
    hls_playlist_requests..........: 504    27.785485/s
    hls_segment_duration...........: avg=11.69ms min=629.37µs med=1.26ms   max=505.56ms p(90)=3.15ms   p(95)=5.46ms   p(99)=504.23ms
    hls_segment_failures...........: 0      0/s
    hls_segment_requests...........: 252    13.892743/s
    hls_session_failures...........: 0.00%  0 out of 252
    selected_edge_node.............: 756    41.678228/s

    HTTP
    http_req_duration..............: avg=9.87ms  min=130.68µs med=569.62µs max=3.15s    p(90)=2.32ms   p(95)=3.62ms   p(99)=11.74ms 
      { expected_response:true }...: avg=9.87ms  min=130.68µs med=569.62µs max=3.15s    p(90)=2.32ms   p(95)=3.62ms   p(99)=11.74ms 
    http_req_failed................: 0.00%  0 out of 768
    http_reqs......................: 768    42.339787/s

    EXECUTION
    iteration_duration.............: avg=232.9ms min=202.11ms med=204.21ms max=3.88s    p(90)=210.28ms p(95)=215.61ms p(99)=722.83ms
    iterations.....................: 252    13.892743/s
    vus............................: 3      min=1        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 292 MB 16 MB/s
    data_sent......................: 157 kB 8.6 kB/s



running (18.1s), 0/5 VUs, 252 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/5 VUs  18s